cfe llm/InformationRegisters/AI_ЗаголовкиДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ЗаголовкиДиалогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемныйПромт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтекста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДиалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийIDОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_Диалоги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификатоБеседыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_РольСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБеседы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_РольСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РольСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>system</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>user</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>assistant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>tool</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/CommonModules/AI_ДиалогиСервер/Ext/Module.bsl
Функция СоздатьДиалог(ИдентификаторПользователя, Настройки = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		ВызватьИсключение "Не удалось определить пользователя диалога.";
	КонецЕсли;

	ИдентификаторДиалога = Новый УникальныйИдентификатор;
	ТекущаяДата = ТекущаяДатаСеанса();
	Запись = НовыйМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись.Заголовок = "Новый диалог";
	Запись.ДатаСоздания = ТекущаяДата;
	Запись.ДатаИзменения = ТекущаяДата;
	Запись.Архивирован = Ложь;
	Запись.КоличествоСообщений = 0;
	ЗаполнитьНастройкиЗаголовка(Запись, Настройки);
	Запись.Записать();
	Возврат ИдентификаторДиалога;

КонецФункции

Функция ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога) Экспорт

	Если Не ЗаголовокСуществует(ИдентификаторПользователя, ИдентификаторДиалога) Тогда
		ВызватьИсключение "Диалог не найден или недоступен.";
	КонецЕсли;
	Возврат Истина;

КонецФункции

Функция ПроверитьДоступКИзменению(ИдентификаторПользователя, ИдентификаторДиалога) Экспорт

	ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись = ПрочитатьМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	Если Запись.Архивирован Тогда
		ВызватьИсключение "Диалог находится в архиве. Верните его из архива для продолжения.";
	КонецЕсли;
	Возврат Истина;

КонецФункции

Функция ПолучитьСообщения(ИдентификаторПользователя, ИдентификаторДиалога,
		КоличествоСообщений = 20) Экспорт

	ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога);
	Возврат ПрочитатьСообщения(
		ИдентификаторПользователя,
		ИдентификаторДиалога,
		КоличествоСообщений);

КонецФункции

Функция ПолучитьСообщенияОперации(ИдентификаторОперации, КоличествоСообщений = 20) Экспорт

	Операция = ПолучитьВладельцаИДиалогОперации(ИдентификаторОперации);
	Возврат ПолучитьСообщения(
		Операция.ИдентификаторПользователя,
		Операция.ИдентификаторДиалога,
		КоличествоСообщений);

КонецФункции

Функция ЗаписатьСобытие(ИдентификаторПользователя, ИдентификаторДиалога,
		Роль, Сообщение, ИдентификаторСообщения = Неопределено) Экспорт

	ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога);
	НачатьТранзакцию();
	Попытка
		ИдентификаторСообщения = ЗаписатьСообщениеБезПроверки(
			ИдентификаторПользователя,
			ИдентификаторДиалога,
			Роль,
			Сообщение,
			ИдентификаторСообщения);
		ОбновитьЗаголовокПослеСообщения(
			ИдентификаторПользователя,
			ИдентификаторДиалога,
			Роль,
			Сообщение);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат ИдентификаторСообщения;

КонецФункции

Процедура ЗаписатьПаруСообщенийОперации(ИдентификаторОперации,
		ТекстПользователя, ТекстАссистента, ИдентификаторСообщенияПользователя,
		НовыйIDОтвета = "") Экспорт

	Операция = ПолучитьВладельцаИДиалогОперации(ИдентификаторОперации);
	ПроверитьДоступ(Операция.ИдентификаторПользователя, Операция.ИдентификаторДиалога);
	Если СообщениеСуществует(
			Операция.ИдентификаторДиалога,
			ИдентификаторСообщенияПользователя) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		ЗаписатьСообщениеБезПроверки(
			Операция.ИдентификаторПользователя,
			Операция.ИдентификаторДиалога,
			Перечисления.AI_РольСообщения.user,
			ТекстПользователя,
			ИдентификаторСообщенияПользователя);
		ЗаписатьСообщениеБезПроверки(
			Операция.ИдентификаторПользователя,
			Операция.ИдентификаторДиалога,
			Перечисления.AI_РольСообщения.assistant,
			ТекстАссистента);

		Заголовок = ПрочитатьМенеджерЗаголовка(
			Операция.ИдентификаторПользователя,
			Операция.ИдентификаторДиалога);
		Если Заголовок.КоличествоСообщений = 0 Тогда
			Заголовок.Заголовок = ЗаголовокИзСообщения(ТекстПользователя);
		КонецЕсли;
		Заголовок.КоличествоСообщений = Заголовок.КоличествоСообщений + 2;
		Заголовок.ПоследнееСообщение = КраткийТекст(ТекстАссистента, 300);
		Заголовок.ДатаИзменения = ТекущаяДатаСеанса();
		Заголовок.ПредыдущийIDОтвета = Лев(Строка(НовыйIDОтвета), 200);
		Заголовок.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьДиалоги(ИдентификаторПользователя, СтрокаПоиска = "",
		ПоказыватьАрхивные = Ложь, Лимит = 50) Экспорт

	Лимит = Макс(1, Мин(Цел(Лимит), 200));
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(
		"ВЫБРАТЬ ПЕРВЫЕ 999999
		|    Заголовки.ИдентификаторДиалога КАК ИдентификаторДиалога,
		|    Заголовки.Заголовок КАК Заголовок,
		|    Заголовки.ДатаСоздания КАК ДатаСоздания,
		|    Заголовки.ДатаИзменения КАК ДатаИзменения,
		|    Заголовки.Агент КАК Агент,
		|    Заголовки.ПоследнееСообщение КАК ПоследнееСообщение,
		|    Заголовки.КоличествоСообщений КАК КоличествоСообщений,
		|    Заголовки.Архивирован КАК Архивирован
		|ИЗ
		|    РегистрСведений.AI_ЗаголовкиДиалогов КАК Заголовки
		|ГДЕ
		|    Заголовки.ИдентификаторПользователя = &ИдентификаторПользователя
		|    И (&ПоказыватьАрхивные ИЛИ НЕ Заголовки.Архивирован)
		|    И (НЕ &ЕстьСтрокаПоиска ИЛИ Заголовки.Заголовок ПОДОБНО &ШаблонПоиска)
		|УПОРЯДОЧИТЬ ПО
		|    Заголовки.ДатаИзменения УБЫВ",
		"999999",
		Строка(Лимит));
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Запрос.УстановитьПараметр("ПоказыватьАрхивные", ПоказыватьАрхивные);
	Запрос.УстановитьПараметр("ЕстьСтрокаПоиска", ЗначениеЗаполнено(СокрЛП(Строка(СтрокаПоиска))));
	Запрос.УстановитьПараметр("ШаблонПоиска", "%" + СокрЛП(Строка(СтрокаПоиска)) + "%");

	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура(
			"ИдентификаторДиалога,Заголовок,ДатаСоздания,ДатаИзменения,Агент,ПоследнееСообщение,КоличествоСообщений,Архивирован",
			Выборка.ИдентификаторДиалога,
			Выборка.Заголовок,
			Выборка.ДатаСоздания,
			Выборка.ДатаИзменения,
			Выборка.Агент,
			Выборка.ПоследнееСообщение,
			Выборка.КоличествоСообщений,
			Выборка.Архивирован));
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция СообщениеСуществует(ИдентификаторДиалога, ИдентификаторСообщения)

	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Диалоги.ИдентификаторСообщения
		|ИЗ
		|    РегистрСведений.AI_Диалоги КАК Диалоги
		|ГДЕ
		|    Диалоги.ИдентификаторБеседы = &ИдентификаторДиалога
		|    И Диалоги.ИдентификаторСообщения = &ИдентификаторСообщения");
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция ПолучитьНастройки(ИдентификаторПользователя, ИдентификаторДиалога) Экспорт

	ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись = ПрочитатьМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	Возврат Новый Структура(
		"ИдентификаторДиалога,Заголовок,Провайдер,Модель,Агент,ТипAPI,СистемныйПромт,ДанныеКонтекста,Сценарий,КонтекстJSON,ВерсияКонтекста,ТипИсточника,КлючИсточника,ПредставлениеИсточника,ГлубинаДиалога,Архивирован,ПредыдущийIDОтвета",
		ИдентификаторДиалога,
		Запись.Заголовок,
		Запись.Провайдер,
		Запись.Модель,
		Запись.Агент,
		Запись.ТипAPI,
		Запись.СистемныйПромт,
		Запись.ДанныеКонтекста,
		Запись.Сценарий,
		Запись.КонтекстJSON,
		Запись.ВерсияКонтекста,
		Запись.ТипИсточника,
		Запись.КлючИсточника,
		Запись.ПредставлениеИсточника,
		Запись.ГлубинаДиалога,
		Запись.Архивирован,
		Запись.ПредыдущийIDОтвета);

КонецФункции

Процедура ОбновитьНастройки(ИдентификаторПользователя, ИдентификаторДиалога, Настройки) Экспорт

	ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись = ПрочитатьМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	ЗаполнитьНастройкиЗаголовка(Запись, Настройки);
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Записать();

КонецПроцедуры

Процедура Переименовать(ИдентификаторПользователя, ИдентификаторДиалога, НовыйЗаголовок) Экспорт

	ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога);
	НовыйЗаголовок = КраткийТекст(НовыйЗаголовок, 150);
	Если Не ЗначениеЗаполнено(НовыйЗаголовок) Тогда
		ВызватьИсключение "Заголовок диалога не может быть пустым.";
	КонецЕсли;
	Запись = ПрочитатьМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись.Заголовок = НовыйЗаголовок;
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Записать();

КонецПроцедуры

Процедура УстановитьАрхив(ИдентификаторПользователя, ИдентификаторДиалога, Архивирован) Экспорт

	ПроверитьДоступ(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись = ПрочитатьМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись.Архивирован = ?(Архивирован, Истина, Ложь);
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Записать();

КонецПроцедуры

Процедура МигрироватьДиалогиПользователя(ИдентификаторПользователя) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|    Операции.ИдентификаторДиалога КАК ИдентификаторДиалога
		|ИЗ
		|    РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		|    Операции.ИдентификаторПользователя = &ИдентификаторПользователя
		|    И Операции.ИдентификаторДиалога <> &ПустойИдентификатор";
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗаголовокСуществует(ИдентификаторПользователя, Выборка.ИдентификаторДиалога)
			Или ЕстьДругойВладелецДиалога(ИдентификаторПользователя, Выборка.ИдентификаторДиалога) Тогда
			Продолжить;
		КонецЕсли;
		МигрироватьДиалог(
			ИдентификаторПользователя,
			Выборка.ИдентификаторДиалога);
	КонецЦикла;

КонецПроцедуры

Функция УдалитьДиалогиДо(Граница) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|    Заголовки.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|    Заголовки.ИдентификаторДиалога КАК ИдентификаторДиалога
		|ИЗ
		|    РегистрСведений.AI_ЗаголовкиДиалогов КАК Заголовки
		|ГДЕ
		|    Заголовки.ДатаИзменения < &Граница";
	Запрос.УстановитьПараметр("Граница", Граница);
	Диалоги = Запрос.Выполнить().Выгрузить();
	Удалено = 0;

	Для Каждого Диалог Из Диалоги Цикл
		НачатьТранзакцию();
		Попытка
			Набор = РегистрыСведений.AI_Диалоги.СоздатьНаборЗаписей();
			Набор.Отбор.ИдентификаторБеседы.Установить(Диалог.ИдентификаторДиалога);
			Набор.Записать();
			Заголовок = НовыйМенеджерЗаголовка(
				Диалог.ИдентификаторПользователя,
				Диалог.ИдентификаторДиалога);
			Заголовок.Удалить();
			ЗафиксироватьТранзакцию();
			Удалено = Удалено + 1;
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	Возврат Удалено;

КонецФункции

Функция ПолучитьДиагностикуМиграции() Экспорт

	ПустойИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|    КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|    РегистрСведений.AI_Диалоги КАК Диалоги
		|ГДЕ
		|    Диалоги.ИдентификаторПользователя = &ПустойИдентификатор;
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|    КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Операции.ИдентификаторДиалога) КАК Количество
		|ИЗ
		|    РегистрСведений.AI_АгентскиеОперации КАК Операции
		|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AI_ЗаголовкиДиалогов КАК Заголовки
		|        ПО Операции.ИдентификаторПользователя = Заголовки.ИдентификаторПользователя
		|            И Операции.ИдентификаторДиалога = Заголовки.ИдентификаторДиалога
		|ГДЕ
		|    Заголовки.ИдентификаторДиалога ЕСТЬ NULL");
	Запрос.УстановитьПараметр("ПустойИдентификатор", ПустойИдентификатор);
	Результаты = Запрос.ВыполнитьПакет();
	Сообщения = Результаты[0].Выбрать();
	Диалоги = Результаты[1].Выбрать();
	Сообщения.Следующий();
	Диалоги.Следующий();
	Возврат Новый Структура(
		"СообщенийБезВладельца,ДиалоговБезЗаголовка",
		Сообщения.Количество,
		Диалоги.Количество);

КонецФункции

Функция ПрочитатьСообщения(ИдентификаторПользователя, ИдентификаторДиалога, КоличествоСообщений)

	КоличествоСообщений = Макс(1, Мин(Цел(КоличествоСообщений), 500));
	Запрос = Новый Запрос;
	Запрос.Текст = СтрЗаменить(
		"ВЫБРАТЬ ПЕРВЫЕ 999999
		|    Диалоги.Период КАК Период,
		|    Диалоги.Роль КАК Роль,
		|    Диалоги.Сообщение КАК Сообщение
		|ИЗ
		|    РегистрСведений.AI_Диалоги КАК Диалоги
		|ГДЕ
		|    Диалоги.ИдентификаторБеседы = &ИдентификаторДиалога
		|    И Диалоги.ИдентификаторПользователя = &ИдентификаторПользователя
		|    И Диалоги.Роль В (
		|        ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.user),
		|        ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.assistant))
		|УПОРЯДОЧИТЬ ПО
		|    Диалоги.Период УБЫВ,
		|    ВЫБОР
		|        КОГДА Диалоги.Роль = ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.assistant)
		|            ТОГДА 1
		|        ИНАЧЕ 0
		|    КОНЕЦ УБЫВ",
		"999999",
		Строка(КоличествоСообщений));
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);

	ОбратныйПорядок = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбратныйПорядок.Добавить(Новый Структура(
			"Период,Роль,Сообщение",
			Выборка.Период,
			НРег(Строка(Выборка.Роль)),
			Выборка.Сообщение));
	КонецЦикла;

	Результат = Новый Массив;
	Индекс = ОбратныйПорядок.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Результат.Добавить(ОбратныйПорядок[Индекс]);
		Индекс = Индекс - 1;
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ЗаписатьСообщениеБезПроверки(ИдентификаторПользователя,
		ИдентификаторДиалога, Роль, Сообщение,
		ИдентификаторСообщения = Неопределено)

	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ИдентификаторСообщения = Новый УникальныйИдентификатор;
	КонецЕсли;
	Запись = РегистрыСведений.AI_Диалоги.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторБеседы = ИдентификаторДиалога;
	Запись.ИдентификаторСообщения = ИдентификаторСообщения;
	Запись.ИдентификаторПользователя = ИдентификаторПользователя;
	Запись.ИдентификатоБеседыСтрокой = Строка(ИдентификаторДиалога);
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Сообщение = Строка(Сообщение);
	Запись.Роль = ?(ТипЗнч(Роль) = Тип("Строка"), Перечисления.AI_РольСообщения[Роль], Роль);
	Запись.Записать(Ложь);
	Возврат ИдентификаторСообщения;

КонецФункции

Процедура ОбновитьЗаголовокПослеСообщения(ИдентификаторПользователя,
		ИдентификаторДиалога, Роль, Сообщение)

	Запись = ПрочитатьМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	Если Запись.КоличествоСообщений = 0
		И Роль = Перечисления.AI_РольСообщения.user Тогда
		Запись.Заголовок = ЗаголовокИзСообщения(Сообщение);
	КонецЕсли;
	Запись.КоличествоСообщений = Запись.КоличествоСообщений + 1;
	Запись.ПоследнееСообщение = КраткийТекст(Сообщение, 300);
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Записать();

КонецПроцедуры

Функция ЗаголовокСуществует(ИдентификаторПользователя, ИдентификаторДиалога)

	Если Не ЗначениеЗаполнено(ИдентификаторПользователя)
		Или Не ЗначениеЗаполнено(ИдентификаторДиалога) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Заголовки.ИдентификаторДиалога
		|ИЗ
		|    РегистрСведений.AI_ЗаголовкиДиалогов КАК Заголовки
		|ГДЕ
		|    Заголовки.ИдентификаторПользователя = &ИдентификаторПользователя
		|    И Заголовки.ИдентификаторДиалога = &ИдентификаторДиалога");
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция НовыйМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога)

	Запись = РегистрыСведений.AI_ЗаголовкиДиалогов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторПользователя = ИдентификаторПользователя;
	Запись.ИдентификаторДиалога = ИдентификаторДиалога;
	Возврат Запись;

КонецФункции

Функция ПрочитатьМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога)

	Запись = НовыйМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
	Запись.Прочитать();
	Возврат Запись;

КонецФункции

Процедура ЗаполнитьНастройкиЗаголовка(Запись, Настройки)

	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "Провайдер");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "Модель");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "Агент");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "ТипAPI");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "СистемныйПромт");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "ДанныеКонтекста");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "Сценарий");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "КонтекстJSON");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "ВерсияКонтекста");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "ТипИсточника");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "КлючИсточника");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "ПредставлениеИсточника");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "ГлубинаДиалога");
	УстановитьСвойствоЕслиЕсть(Запись, Настройки, "ПредыдущийIDОтвета");

КонецПроцедуры

Процедура УстановитьСвойствоЕслиЕсть(Запись, Настройки, ИмяСвойства)

	ЗначениеСвойства = Неопределено;
	Если Настройки.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
		Запись[ИмяСвойства] = ЗначениеСвойства;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьВладельцаИДиалогОперации(ИдентификаторОперации)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Операции.ИдентификаторПользователя КАК ИдентификаторПользователя,
		|    Операции.ИдентификаторДиалога КАК ИдентификаторДиалога
		|ИЗ
		|    РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		|    Операции.ИдентификаторОперации = &ИдентификаторОперации");
	Запрос.УстановитьПараметр("ИдентификаторОперации", ИдентификаторОперации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение "Агентская операция не найдена.";
	КонецЕсли;
	Возврат Новый Структура(
		"ИдентификаторПользователя,ИдентификаторДиалога",
		Выборка.ИдентификаторПользователя,
		Выборка.ИдентификаторДиалога);

КонецФункции

Функция ЕстьДругойВладелецДиалога(ИдентификаторПользователя, ИдентификаторДиалога)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Операции.ИдентификаторОперации
		|ИЗ
		|    РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		|    Операции.ИдентификаторДиалога = &ИдентификаторДиалога
		|    И Операции.ИдентификаторПользователя <> &ИдентификаторПользователя");
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Заголовки.ИдентификаторДиалога
		|ИЗ
		|    РегистрСведений.AI_ЗаголовкиДиалогов КАК Заголовки
		|ГДЕ
		|    Заголовки.ИдентификаторДиалога = &ИдентификаторДиалога
		|    И Заголовки.ИдентификаторПользователя <> &ИдентификаторПользователя";
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Диалоги.ИдентификаторБеседы
		|ИЗ
		|    РегистрСведений.AI_Диалоги КАК Диалоги
		|ГДЕ
		|    Диалоги.ИдентификаторБеседы = &ИдентификаторДиалога
		|    И Диалоги.ИдентификаторПользователя <> &ИдентификаторПользователя
		|    И Диалоги.ИдентификаторПользователя <> &ПустойИдентификатор";
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Запрос.УстановитьПараметр(
		"ПустойИдентификатор",
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Процедура МигрироватьДиалог(ИдентификаторПользователя, ИдентификаторДиалога)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Операции.ДатаСоздания КАК ДатаСоздания,
		|    Операции.ДатаИзменения КАК ДатаИзменения,
		|    Операции.Провайдер КАК Провайдер,
		|    Операции.Модель КАК Модель,
		|    Операции.Агент КАК Агент,
		|    Операции.ТипAPI КАК ТипAPI,
		|    Операции.СистемныйПромт КАК СистемныйПромт,
		|    Операции.ДанныеКонтекста КАК ДанныеКонтекста,
		|    Операции.ГлубинаДиалога КАК ГлубинаДиалога,
		|    Операции.ПредыдущийIDОтвета КАК ПредыдущийIDОтвета,
		|    Операции.Промт КАК Промт
		|ИЗ
		|    РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		|    Операции.ИдентификаторДиалога = &ИдентификаторДиалога
		|    И Операции.ИдентификаторПользователя = &ИдентификаторПользователя
		|УПОРЯДОЧИТЬ ПО
		|    Операции.ДатаИзменения УБЫВ");
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		Заголовок = НовыйМенеджерЗаголовка(ИдентификаторПользователя, ИдентификаторДиалога);
		Заголовок.Заголовок = ЗаголовокИзСообщения(Выборка.Промт);
		Заголовок.ДатаСоздания = Выборка.ДатаСоздания;
		Заголовок.ДатаИзменения = Выборка.ДатаИзменения;
		Заголовок.Провайдер = Выборка.Провайдер;
		Заголовок.Модель = Выборка.Модель;
		Заголовок.Агент = Выборка.Агент;
		Заголовок.ТипAPI = Выборка.ТипAPI;
		Заголовок.СистемныйПромт = Выборка.СистемныйПромт;
		Заголовок.ДанныеКонтекста = Выборка.ДанныеКонтекста;
		Заголовок.ГлубинаДиалога = Выборка.ГлубинаДиалога;
		Заголовок.ПредыдущийIDОтвета = Выборка.ПредыдущийIDОтвета;
		Заголовок.Архивирован = Ложь;
		Заголовок.КоличествоСообщений = НазначитьВладельцаСтарымСообщениям(
			ИдентификаторПользователя,
			ИдентификаторДиалога);
		Заголовок.ПоследнееСообщение = ПоследнееСообщениеДиалога(ИдентификаторДиалога);
		Заголовок.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция НазначитьВладельцаСтарымСообщениям(ИдентификаторПользователя, ИдентификаторДиалога)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|    Диалоги.Период КАК Период,
		|    Диалоги.ИдентификаторБеседы КАК ИдентификаторБеседы,
		|    Диалоги.ИдентификаторСообщения КАК ИдентификаторСообщения
		|ИЗ
		|    РегистрСведений.AI_Диалоги КАК Диалоги
		|ГДЕ
		|    Диалоги.ИдентификаторБеседы = &ИдентификаторДиалога");
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Строки = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДиалога Из Строки Цикл
		Запись = РегистрыСведений.AI_Диалоги.СоздатьМенеджерЗаписи();
		Запись.Период = СтрокаДиалога.Период;
		Запись.ИдентификаторБеседы = СтрокаДиалога.ИдентификаторБеседы;
		Запись.ИдентификаторСообщения = СтрокаДиалога.ИдентификаторСообщения;
		Запись.Прочитать();
		Запись.ИдентификаторПользователя = ИдентификаторПользователя;
		Запись.Записать();
	КонецЦикла;
	Возврат Строки.Количество();

КонецФункции

Функция ПоследнееСообщениеДиалога(ИдентификаторДиалога)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|    Диалоги.Сообщение КАК Сообщение
		|ИЗ
		|    РегистрСведений.AI_Диалоги КАК Диалоги
		|ГДЕ
		|    Диалоги.ИдентификаторБеседы = &ИдентификаторДиалога
		|УПОРЯДОЧИТЬ ПО
		|    Диалоги.Период УБЫВ");
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), КраткийТекст(Выборка.Сообщение, 300), "");

КонецФункции

Функция ЗаголовокИзСообщения(Текст)

	Результат = КраткийТекст(Текст, 80);
	Возврат ?(ЗначениеЗаполнено(Результат), Результат, "Новый диалог");

КонецФункции

Функция КраткийТекст(Текст, МаксимальнаяДлина)

	Результат = СокрЛП(Строка(Текст));
	Результат = СтрЗаменить(Результат, Символы.ПС, " ");
	Результат = СтрЗаменить(Результат, Символы.ВК, " ");
	Пока СтрНайти(Результат, "  ") > 0 Цикл
		Результат = СтрЗаменить(Результат, "  ", " ");
	КонецЦикла;
	Возврат Лев(Результат, МаксимальнаяДлина);

КонецФункции
